### Оставил ту часть кода, в которой разбирался  с данными

import pandas as pd

url = f'https://stepik.org/media/attachments/lesson/755303/23110000100100200001_%D0%9E%D0%B1%D1%89%D0%B8%D0%B9_%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D1%81%D1%82_%D0%BF%D0%BE%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%BD%D0%BE%D0%B3%D0%BE_%D0%BD%D0%B0%D1%81%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F.html'

data = pd.read_html(url, skiprows=2)
df = data[0]
print(df)
df2 = pd.DataFrame(df, columns = ['Unnamed: 0','2014 г.', '2015 г.', '2016 г.', '2017 г.', '2018 г.', '2019 г.', '2020 г.'],copy = True)
df2.to_csv('4.5.12.csv')
print(df2.dtypes)
print(df2[df2['Unnamed: 0'] == 'Камчатский край'].sum(axis=1, numeric_only=True))



### Задание 4.5.13. Взято из списка решений, ибо моё было через пень-колоду
df = df.iloc[:,:10] #обрезаем лишнюю часть ДФ
filter_list = ['Ярославская область', 'Свердловская область', 'Магаданская область', 'Кировская область', 'Калужская область', 'Сахалинская область'] #создаем фильтр регионов
df.columns = ['Region', 'Code', '2022.01', '2014', '2015', '2016', '2017', '2018', '2019', '2020'] #переименовываем столбцы для наглядности
df['2020'] = df['2020'].fillna(0) #заменяем NaN на нули
df['2020'] = df['2020'].astype('int') #в нужном столбце меняем тип данных со строк на integer
df = df.query(f'Region=={filter_list}') #делаем запрос по фильтр-списку регионов
print(df.sort_values('2020', ascending=True).head(1)) #сортируем от меньшего к большему и выводим только верхний результат